{
  "locations": [
    {
      "id": 1,
      "title": "Пристань",
      "image": "harbor.jpg",
      "description": "Высадившись из лодки, стоя на пристани, перед вами предстаёт следующий вид: на берегу вверх дном лежит пара лодок, рядом с ними возятся 3 человека, очевидно они заняты починкой, от берега ведёт дорога в глубь материка. Вы видите деревянную доску, висящую в воздухе, на ней переливающимися буквами то появляется, то исчезает надпись: «Добро пожаловать на Хардвинн!» Под надписью нарисована карта острова, прибитая на 4 заклёпки. Справа в углу карты надпись: «Это волшебная карта! Прикоснись к ней — и она покажет, где ты!»",
      "actions": {
        "main_menu": "Главное меню",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2e1f0f",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 2,
      "title": "Площадь деревни",
      "image": "village_square.jpg",
      "description": "Вы входите в деревню. Слева и справа стоят захудалые домики, впереди виднеется большое здание, на табличке красуется надпись: «Гостиница Оплот магов». За гостиницу ведёт улица к небольшой площади в центре деревни. На торговой площади справа открывается дивный вид на лавки со всевозможными продуктами: рыба, экзотические фрукты и приправы. По центру идут ряды со всевозможными украшениями, сувенирами и прочими безделушками. С левой стороны в ряд идут магазины: аптекарь «Мамкин лекарь», мастерская оружия «Молот и наковальня» и лавка с оборудованием для магов «От дерева до Посоха». Налево от площади идет улочка к Гильдии магов, за Гильдией есть небольшой паб «Откормленная вобла».",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#3a3a3a",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 3,
      "title": "Сосновый лес",
      "image": "forest.jpg",
      "description": "Пройдя по дороге от деревни, перед вашим взором показывается сосновый лес. Дорога идёт сквозь него. Посередине леса находится небольшая развилка: основная дорога идёт прямо, но есть и тропинка, сворачивающая направо.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#1b3b1b",
        "color": "#e0e0e0"
      }
    },
    {
      "id": 4,
      "title": "Древний монумент",
      "image": "monument.jpg",
      "description": "Пройдя лес, вы видите что-то вроде тропы, уходящей влево, через чащу густых зарослей. Основная же дорога ведёт вас направо, прямиком в коллегию.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#3b3b3b",
        "color": "#f0f0f0"
      }
    },
    {
      "id": 5,
      "title": "Коллегия магов",
      "image": "collegium.jpg",
      "description": "Идя по дороге, вы видите издалека шпили и башни Коллегии. Подойдя ближе к огромному замку с разнообразными башнями, ходами и комплексами, где изучаются и практикуются различные искусства магии, около входа вас встречают два мага.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2c2c2c",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 6,
      "title": "Зараженное крыло - 1 этаж",
      "image": "infected_wing_floor1.jpg",
      "description": "После успешной телепортации вы оказываетесь на первом этаже заражённого крыла — в гостиной-столовой. На первый взгляд всё обычно: выходя из небольшой комнаты телепортации, вы попадаете в зал, весьма широкий. Вы видите столы, лавки, диван около камина, справа проход на лестницу, где также расположена небольшая кладовая. Слишком мирная обстановка царит в зале…",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2d2d2d",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 7,
      "title": "Зараженное крыло - 2 этаж (небольшая комната)",
      "image": "infected_wing_floor2_small_room.jpg",
      "description": "Вы поднимаетесь на второй этаж и попадаете в небольшую комнату. Ты, Коргрейв, хоть и знаешь коллегию от и до, но это помещение видишь впервые. В конце комнаты расположена дверь.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2a2a2a",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 8,
      "title": "Зараженное крыло - 2 этаж (лаборатория)",
      "image": "infected_wing_floor2_lab.jpg",
      "description": "Пройдя сквозь дверь, вы попадаете в обширную комнату Г-образной формы. Сразу же вы замечаете клетки с разными существами. За поворотом стоит странное существо около пустой клетки.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#292929",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 9,
      "title": "Зараженное крыло - 2 этаж (комната для практики)",
      "image": "infected_wing_floor2_practice_room.jpg",
      "description": "Зайдя в следующую комнату, которая абсолютно пуста, вы замечаете на полу углубления с символами: клык, перстень, знак Солнца Церкви Кирна, плащ и глаз. Чтобы продолжить, нужно стать на плиты в правильном порядке.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2c2c2c",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 10,
      "title": "Зараженное крыло - 2 этаж (библиотека)",
      "image": "infected_wing_floor2_library.jpg",
      "description": "Вы попали в библиотеку. Эта комната очень просторна, кругом стеллажи с книгами разных жанров и тематик. Также вы видите три пьедестала напротив большого витража. Вам предстоит разгадать головоломку с книгами и цифрами, чтобы продвинуться дальше.",
      "actions": {
        "prev_location": "Предыдущая локация",
        "next_location": "Перейти к следующей локации"
      },
      "style": {
        "background": "#2e2e2e",
        "color": "#f5f5dc"
      }
    },
    {
      "id": 11,
      "title": "Финальная битва",
      "image": "final_boss.jpg",
      "description": "Поднявшись выше, вы видите портал, перед которым стоит существо. В этом существе вы узнаёте Порье и Коргрейва — тех двух магов, которые затеяли всё это. Но они преобразились не на шутку: одна голова выходит из другой, две пары рук, три ноги... Существо под трём метра, больше похожее на пропавший холодец, чем на человека. Оно готовится к бою.",
      "actions": {
        "prev_location": "Предыдущая локация"
      },
      "style": {
        "background": "#4d0000",
        "color": "#fff0f0"
      }
    }
  ]
}
